Python 3.6.3 (v3.6.3:2c5fed8, Oct  3 2017, 17:26:49) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> 8/4
2.0
>>> 8 / 5
1.6
>>> 5 + 8 / 2
9.0
>>> int(5 + 8 / 2)
9
>>> 9 // 8
1
>>> 28 // 3
9
>>> 8 % 5
3
>>> 8 % 5.5
2.5
>>> 12 % 5.5
1.0
>>> 12 // 5.5, 12 % 5.5
(2.0, 1.0)
>>> 
>>> 
>>> 2 ** 3
8
>>> 3 ** 1.58
5.6735068357019065
>>> 5 * 6
30
>>> 
>>> 
>>> s = 0
>>> s + 1
1
>>> s
0
>>> s = s + 1
>>> id(s)
1924650800
>>> id(1)
1924650800
>>> 2/3
0.6666666666666666
>>> f"{2/3.40f}"
SyntaxError: invalid syntax
>>> f"{2/3:.40f}"
'0.6666666666666666296592325124947819858789'
>>> f"{2/3:.140f}"
'0.66666666666666662965923251249478198587894439697265625000000000000000000000000000000000000000000000000000000000000000000000000000000000000000'
>>> 0.1 * 3
0.30000000000000004
>>> 9 ** 18
150094635296999121
>>> 9 ** 98
3279185047850305794305942247355304034928808057449314765118209404186327048164224481412156778321
>>> from sys import getsizeof
>>> getsizeof(9 ** 98)
54
>>> 
>>> 
>>> s = s + 1
>>> s
2
>>> 
>>> 
>>> s = 0
>>> 
>>> s = s + 1
>>> s = s + 1
>>> s
2
>>> s += 1
>>> s
3
>>> s += 10
>>> s
13
>>> s -= 10
>>> s
3
>>> s *= 10
>>> s
30
>>> s /= 10
>>> s
3.0
>>> s = 30
>>> s //= 10
>>> s
3
>>> 
>>> 
>>> 
>>> 2 +6.0
8.0
>>> int(2 + 6.0)
8
>>> 
>>> 
>>> 
>>> x = 45
>>> d1 = x % 10
>>> d1
5
>>> d2 = x // 10
>>> d2
4
>>> print(d2, d1)
4 5
>>> print(d1, d2)
5 4
>>> 
>>> reverse_x = d1 * 10 + d2
>>> reverse_x
54
>>> reverse_x * 12
648
>>> 
>>> 
>>> x = 562
>>> reverse_x = x % 10 * 100 + x // 10 % 10 * 10 + x // 100
>>> reverse_x
265
>>> 
============= RESTART: D:/199/7_2/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 8593
Traceback (most recent call last):
  File "D:/199/7_2/22.10.04/შებრუნებული რიცხვი.py", line 5, in <module>
    r_numb = r_numb * 10 + x % 10
NameError: name 'x' is not defined
>>> 
============= RESTART: D:/199/7_2/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 8593
>>> r_numb
3958
>>> 
============= RESTART: D:/199/7_2/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 128
Reversed number is 821
>>> 
============= RESTART: D:/199/7_2/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 100
Reversed number is 1
>>> 
============= RESTART: D:/199/7_2/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 584123698714
Reversed number is 417896321485
>>> 
>>> 
>>> int(True)
1
>>> int(False)
0
>>> 
>>> bool(0)
False
>>> bool(58941232)
True
>>> bool(-589)
True
>>> 
