Python 3.6.3 (v3.6.3:2c5fed8, Oct  3 2017, 17:26:49) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> 2 **3
8
>>> 
>>> 
>>> x = 45
>>> 

>>> s = 0
>>> s + 1
1
>>> s = s + 1
>>> s
1
>>> s = s + 1
>>> s
2
>>> s += 1
>>> s
3
>>> s += 10
>>> s
13
>>> s -= 10
>>> s
3
>>> s *= 5
>>> s
15
>>> s /= 5
>>> s
3.0
>>> s = 15
>>> s //= 5
>>> s.
SyntaxError: invalid syntax
>>> s
3
>>> s %= 5
>>> s
3
>>> s %= 3
>>> s
0
>>> s
0
>>> s % = 7
SyntaxError: invalid syntax
>>> s %= 7
>>> s
0
>>> 
>>> x = 45
>>> d1 = x % 10
>>> d1
5
>>> d2 = x // 10
>>> 
>>> print(d1, d2)
5 4
>>> print(d1, d2, sep='')
54
>>> print(15, 16)
15 16
>>> print(15, 16, sep='***')
15***16
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
141525
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
141525paata
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
141525Paata
Mamporia
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
141525Paata
Mamporia
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
141525 Paata
Mamporia
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
141525 Paata
Mamporia
>>> 2+3
5
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
14 15 25
 Paata
Mamporia
>>> 
============= RESTART: D:\199\7_4\22.10.04\მარტივი არითმეტიკა.py =============
14
15
25
 Paata
Mamporia
>>> 
>>> 
>>> x = 45
>>> d1 = x % 10
>>> d2 = x //= 10
SyntaxError: invalid syntax
>>> d2 = x // 10
>>> d1. d2
Traceback (most recent call last):
  File "<pyshell#50>", line 1, in <module>
    d1. d2
AttributeError: 'int' object has no attribute 'd2'
>>> d1, d2
(5, 4)
>>> 
>>> x = 45
>>> reverse_x = x % 10 * 10 + x // 10
>>> reverse_x
54
>>> reverse_x * 10
540
>>> 
>>> 
>>> x = 581
>>> reverse_x = x % 10 * 100 + x // 10 % 10 * 10 + x // 100
>>> reverse_x
185
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 8593
0
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 8593
3958
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 10010058
85001001
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 100
1
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 5
5
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 51
15
>>> r_numb * 10
150
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 8593
3958
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 10
1
>>> 
============= RESTART: D:/199/7_4/22.10.04/შებრუნებული რიცხვი.py =============
Enter an integer: 123321
123321
>>> 
